        </div>
        <div class="right">
        <h2>Новые услуги<br />
          <span> Мебель на заказ</span></h2>
        <p><strong>Мебель для прихожих и гостиных комнат</strong><br />
          Корпусная мебель для прихожих может быть как встроенной, так и мобильной. Основным предметом обстановки интерьеров прихожих комнат являются разнообразные шифоньеры и шкафы.<br />
          <em><span> 2012 - фотографии</span></em> - <a href="">Комментарии</a></p>
        <p><strong>Мебель для спальни</strong><br />
          Оформление спальни требует учета массы нюансов, ведь в этой комнате по статистике человек проводит одну треть своей жизни<br />
          <em><span> 2012 - фотографии</span></em> - <a href="#">Комментарии</a><br />
          <br />
        </p>
        <h2>Изготовление мебели<br />
          <span> Иготовим в короткие сроки</span></h2>
        <p><strong>2012</strong><br />
          Мы изготавливаем мебель из дуба, сосны, лиственницы, других пород дерева. Вы можете выбрать любой понравившийся по своей текстуре и цвету сорт древесины.</p>
        <p><strong>2012</strong><br />
В воссоздании антикварной или старинной модели по фотографии, мы применяем технологии старения, – патинирование, кракле. В создании уникальной модели мебели помогут наши дизайнеры.</p>
        <p><strong>2012</strong><br />
          Вы сможете проконтролировать весь процесс изготовления мебели: с момента проектирования до сборки высококлассных комплектующих, соавторами которых будете Вы сами.</p>
        <div class="bg"></div>
        <p><a href="#">+ Дополнительно</a></p>
      </div>
    
      <div class="clr"></div>
    </div>
    <div class="clr"></div>
  </div>
  <div class="footer">
    <div class="footer_resize">
      <p class="leftt">SiteY.ru &copy; 2013 </p>

      <div class="clr"></div>
    </div>
  </div>                              
</div>
<!-- Конец -->
                                                                                                                                                                                                                                                                                                       <p align="right"><a target="_blank" style="text-decoration: none; color: #0095F9" href="http://sitey.ru/"> Личный сайт</a> &nbsp; &nbsp; &nbsp; </p>
</body>
</html>